# BuiltInFailures.RevisionFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevisionFailures Class
BuiltInFailures Class Members See Also
---
Failures about Revision Settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RevisionFailures
```

Visual Basic
---
```text
Public NotInheritable Class RevisionFailures
```

Visual C++
---
```text
public ref class RevisionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RevisionFailures
# See Also
BuiltInFailures..::..RevisionFailures Members
Autodesk.Revit.DB Namespace